Terraform Format and Style: success
Terraform Initialization: success
Terraform Validation: success
Terraform Plan: success

<details><summary>Show Plan</summary>

```

null_resource.prevent_destroy: Refreshing state... [id=8846663655257903885]
data.cloudfoundry_space.space: Reading...
module.redis-v70.data.cloudfoundry_service_plans.redis: Reading...
module.redis-v70.data.cloudfoundry_service_plans.redis: Read complete after 0s [name=redis-dev]
data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.ses_email.data.cloudfoundry_service.ses: Reading...
module.egress-space.data.cloudfoundry_org.org: Reading...
module.csv_upload_bucket.data.cloudfoundry_service.s3: Reading...
module.sns_sms.data.cloudfoundry_space.space: Reading...
module.ses_email.data.cloudfoundry_space.space: Reading...
module.csv_upload_bucket.data.cloudfoundry_space.space: Reading...
module.database.data.cloudfoundry_service.rds: Reading...
module.sns_sms.data.cloudfoundry_service.sns: Reading...
module.database.data.cloudfoundry_space.space: Reading...
module.ses_email.data.cloudfoundry_service.ses: Read complete after 1s [id=b41dc2f2-7825-4a8e-987a-ce87a161e670]
module.csv_upload_bucket.data.cloudfoundry_service.s3: Read complete after 1s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.sns_sms.data.cloudfoundry_service.sns: Read complete after 1s [id=9c59e780-af5a-4a89-ac31-591a3ae1347e]
module.database.data.cloudfoundry_service.rds: Read complete after 1s [id=dcfb1d43-f22c-42d3-962c-7ae04eda24e7]
module.egress-space.data.cloudfoundry_org.org: Read complete after 1s [id=9e428562-a2d9-41b4-9c23-1ef5237fb44e]
module.egress-space.data.cloudfoundry_user.users["dee18960-b0b1-462b-81f4-f570c7fbe7ef"]: Reading...
module.egress-space.data.cloudfoundry_user.users["carlo.costino@gsa.gov"]: Reading...
module.egress-space.cloudfoundry_space.public_egress: Refreshing state... [id=21b58751-362b-433a-a285-8a1455d9634f]
module.database.data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.database.cloudfoundry_service_instance.rds: Refreshing state... [id=b8caaa4f-b3b8-4dbc-ba16-95d3899be5a0]
module.ses_email.data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.ses_email.cloudfoundry_service_instance.ses: Refreshing state... [id=bc6b3f0b-dc2f-4b46-84d1-3940c29693d7]
module.sns_sms.data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.csv_upload_bucket.data.cloudfoundry_space.space: Read complete after 1s [id=9745decb-4988-4bab-88a4-e3f07b36241c]
module.sns_sms.cloudfoundry_service_instance.sns: Refreshing state... [id=fd12400d-7827-4b16-9ef0-d4277e873fda]
module.csv_upload_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=b15631b3-00fb-49f6-a4d3-ebaedfca1cd9]
module.egress-space.data.cloudfoundry_user.users["carlo.costino@gsa.gov"]: Read complete after 0s [id=c7b9f5e0-4d1b-43b1-a659-e8fe4f7083a8]
module.egress-space.data.cloudfoundry_user.users["dee18960-b0b1-462b-81f4-f570c7fbe7ef"]: Read complete after 0s [id=8b349fbb-2879-4762-9fe7-1ee9a44123e5]
module.egress-space.cloudfoundry_space_users.deployers: Refreshing state... [id=3fbb7982-1e77-4219-cc78-986468887dd7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.redis-v70.cloudfoundry_service_instance.redis will be created
  + resource "cloudfoundry_service_instance" "redis" {
      + created_at        = (known after apply)
      + dashboard_url     = (known after apply)
      + id                = (known after apply)
      + last_operation    = (known after apply)
      + maintenance_info  = (known after apply)
      + name              = "notify-api-redis-v70-staging"
      + parameters        = (sensitive value)
      + service_plan      = "39e035d8-f847-4bf5-a2ee-521c3118cc42"
      + space             = "9745decb-4988-4bab-88a4-e3f07b36241c"
      + tags              = [
          + "terraform-cloudgov-managed",
        ]
      + type              = "managed"
      + updated_at        = (known after apply)
      + upgrade_available = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @terrazoon, Action: `pull_request`*